// Появляется всплывающее окно: "Пароль"
var a = prompt("Пароль", "0");
// В этом блоке при вводе определённой комбинации чисел выдаёт ответ присвоенный этой комбинации. 
if (a == 9583){
   document.write("доступны модули баз A,B и C.");
}
if (a == 1747){
   document.write("доступны модули баз A,B и C.");
}
if (a == 3331){
	document.write("доступны модули баз B и C.");
}
if (a == 7922){
	document.write("доступны модули баз B и C.");
}
if (a == 9455){
	document.write("доступны модули баз C.");
}
if (a == 8997){
	document.write("доступны модули баз C.");
}