var chislo = prompt("Введите число 1го игрока"); //  Инициализируем переменную chislo значением, введенным пользователем в модальное окно
var a=1;k=1; // Начальное значение 
while(a<1000){ // Условие
	var chislo2 = prompt("Введите правильное число"); //  Инициализируем переменную chislo2 значением, введенным пользователем в модальное окно
		if (chislo == chislo2){ // Если переменная chislo= переменной chislo2, то ...	
			alert("Вы угадали!"); // Программа выведет на экран "Вы угадали"
			break; // Прерывает выполнение текущего цикла
		}
		if (chislo>chislo2){ // Если переменная chislo> переменной chislo2, то ...
			alert("Мало"); // Программа выведет на экран "Мало"
			continue; // Цикл продолжается
		}
		k++ // Значение переменной k +1
		if (chislo<chislo2){ // Если переменная chislo< переменной chislo2, то ...
			alert("Много"); // Программа выведет на экран "Много"
			continue; // Цикл продолжается
		}
		k++ // Значение переменной k +1
}
document.write("Количество попыток=" ,k); // Выводит итоговое значение переменной k